ajax/app/controllers/posts_controller.rb

  def latest_posts
    @latest = Post.last(3)
---
SELECT  "posts".* FROM "posts"  ORDER BY "posts"."id" DESC LIMIT 3

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("message", "created_at", "updated_at") VALUES (?, ?, ?)  [["message", "si"], ["created_at", "2016-03-28 22:05:36.963738"], ["updated_at", "2016-03-28 22:05:36.963738"]]